/*
Построить систему классов для описания плоских геометрических фигур: круга,
квадрата, прямоугольника. Предусмотреть методы для создания объектов, перемещения на плоскости,
изменения размеров и вращения на заданный угол.

Программа должна содержать меню, позволяющее осуществить проверку всех методов классов.
*/

#include <iostream>
#include "point.h"

using namespace std;

// class Circle {
//     Point center;
//     float radius;
// public:
//     Circle() {
//         this->center = Point(0, 0);
//         this->radius = 1;
//     }
// };

int main() {
    Point a;
    cout << a << endl;
}